// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт,
//  какое число большее, а какое меньшее.

// Console.Write("Please, enter a number one: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Please, enter a number two: ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num1 > num2) 
// {
//     Console.WriteLine($"max = {num1}, min = {num2}");
// } 
// else if ( num1 < num2)
// {
//     Console.WriteLine($"max = {num2}, min = {num1}");
// }
// else
// {
//     Console.WriteLine("The numbers are equal!");
// }


// Задача 4: Напишите программу, которая принимает на вход три числа и 
// выдаёт максимальное из этих чисел.

// Console.Write("Please, enter a number one: ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Please, enter a number two: ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Please, enter a number three: ");
// int num3 = Convert.ToInt32(Console.ReadLine());

// if (num1 >= num2 && num1 >= num3) 
// {
//     Console.WriteLine(num1);
// }
// else if (num2 >= num1 && num2 >= num3) 
// {
//     Console.WriteLine(num2);
// }
// else if (num3 >= num2 && num3 >= num1) 
// {
//     Console.WriteLine(num3);
// }


// Задача 6: Напишите программу, которая на вход принимает число и выдаёт,
// является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Please, enter a number: ");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num % 2 == 0)
//     Console.WriteLine("The number is even.");
// else 
//     Console.WriteLine("The number is odd.");


// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

// Console.Write("Please, enter a number: ");
// int num = Convert.ToInt32(Console.ReadLine());

// int current = 2;

// while (current <= num) 
// {
//     if (current % 2 == 0)
//         Console.WriteLine(current + " ");
//         current++;
// }